TexasInstruments/motor-control-sdk/examples/position_sense/hdsl_diagnostic/dual_channel/am261x-lp/r5fss0-0_freertos/example.syscfg
section13.load_memory                 = "R5F_TCMB";
section13.$name                       = "Command Response";
section13.output_section.create(1);
section13.output_section[0].$name     = ".gEnDatChInfo";
section13.output_section[0].alignment = 4;

hdsl1.$name                               = "CONFIG_HDSL0";
hdsl1.PRU_Slice                           = "PRU0";
hdsl1.Booster_Pack                        = true;
hdsl1.Mode                                = "SYNC";
hdsl1["PRU-ICSS1"].$assign                = "PRU-ICSS1";
hdsl1["PRU-ICSS1"].PR1_PRU0_GPIO2.$assign = "GPIO83";
hdsl1["PRU-ICSS1"].PR1_PRU0_GPIO1.$assign = "GPIO82";
hdsl1["PRU-ICSS1"].PR1_PRU0_GPIO0.$assign = "GPIO81";
hdsl1["PRU-ICSS1"].PR1_PRU0_GPIO9.$assign = "GPIO80";
hdsl1.ENC0_EN.$name                       = "HDSL0_BP_POWER_EN0";
hdsl1.ENC0_EN.GPIO_n.$assign              = "GPIO21";

hdsl2.$name                               = "CONFIG_HDSL1";
hdsl2.Booster_Pack                        = true;
hdsl2.Mode                                = "SYNC";
hdsl2["PRU-ICSS1"].$assign                = "PRU-ICSS1";
hdsl2["PRU-ICSS1"].PR1_PRU1_GPIO2.$assign = "GPIO73";
hdsl2["PRU-ICSS1"].PR1_PRU1_GPIO1.$assign = "GPIO72";
hdsl2["PRU-ICSS1"].PR1_PRU1_GPIO0.$assign = "GPIO71";
hdsl2["PRU-ICSS1"].PR1_PRU1_GPIO9.$assign = "GPIO74";
hdsl2.ENC0_EN.$name                       = "HDSL1_BP_POWER_EN2";
hdsl2.ENC0_EN.GPIO_n.$assign              = "GPIO22";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.iepSyncMode                     = true;
hdsl1.pru                                = pruicss1;
hdsl2.pru                                = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO1";

soc_timesync_xbar11.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_0";
soc_timesync_xbar11.xbarOutput = "SOC_TIMESYNC_XBAR1_ICSSM0_EDC0_SYNC_OUT_0";
soc_timesync_xbar11.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_1";

soc_timesync_xbar12.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_1";
soc_timesync_xbar12.xbarOutput = "SOC_TIMESYNC_XBAR1_ICSSM0_EDC0_SYNC_OUT_0";
soc_timesync_xbar12.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SCL.$suggestSolution                                                                           = "GPIO135";
i2c1.I2C.SDA.$suggestSolution                                                                           = "GPIO134";
pruicss2.AdditionalICSSSettings[0].PruIepIO[0]["PRU-ICSS0-IEP"].$suggestSolution                        = "PRU-ICSS0-IEP";
pruicss2.AdditionalICSSSettings[0].PruIepIO[0]["PRU-ICSS0-IEP"].PR0_IEP0_EDC_SYNC_OUT0.$suggestSolution = "GPIO119";
